src/DataProcessors/expert1cОбработкаЗаявок/expert1cОбработкаЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>expert1cОбработкаЗаявок</name>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРабот</name>
    <type>
      <types>CatalogRef.ВидыРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПринята</name>
    <type>
      <types>CatalogRef.СтатусЗадачНаВыполнение</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусНазначена</name>
    <type>
      <types>CatalogRef.СтатусЗадачНаВыполнение</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/DataProcessors/expert1cОбработкаЗаявок/Forms/Форма/Module.bsl
// expert1c 03.10.2026 Обработка заявок на выполнение
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Исполнитель) Тогда
		Объект.Исполнитель = Справочники.Пользователи.НайтиПоНаименованию("Завелев Роман Ильич", Истина);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ВидРабот) Тогда
		Объект.ВидРабот = Справочники.ВидыРабот.НайтиПоНаименованию("Поддержка 1С", Истина);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.СтатусПринята) Тогда
		Объект.СтатусПринята = Справочники.СтатусЗадачНаВыполнение.Принята;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.СтатусНазначена) Тогда
		Объект.СтатусНазначена = Справочники.СтатусЗадачНаВыполнение.НайтиПоНаименованию("Назначена", Истина);
		Если НЕ ЗначениеЗаполнено(Объект.СтатусНазначена) Тогда
			Объект.СтатусНазначена = Справочники.СтатусЗадачНаВыполнение.НайтиПоНаименованию("Назначено", Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗаявки(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Исполнитель) Тогда
		ПоказатьПредупреждение(, "Укажите исполнителя, по которому нужно отобрать заявки.");
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = "Будут изменены все заявки на выполнение с исполнителем «" + Объект.Исполнитель
		+ "»: вид работ станет «" + Объект.ВидРабот + "», у заявок в статусах «"
		+ Объект.СтатусПринята + "» и «" + Объект.СтатусНазначена + "» исполнитель будет очищен. Продолжить?";
	ПоказатьВопрос(Новый ОписаниеОповещения("ОбработатьЗаявкиЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗаявкиЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Результат = ВыполнитьНаСервере();
	ПоказатьПредупреждение(, "Обработано заявок: " + Результат.Обработано
		+ Символы.ПС + "Исполнитель очищен: " + Результат.ИсполнительОчищен
		+ Символы.ПС + "Ошибок: " + Результат.Ошибок);
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьНаСервере()
	
	Возврат РеквизитФормыВЗначение("Объект").ВыполнитьОбработку();
	
КонецФункции
// Конец expert1c
